app/controllers/pizzas_controller.rb

    def index
      # get all the pizzas from the database and assign them to an instance variable @pizzas
      @pizzas = Pizza.all
---
SELECT "pizzas".* FROM "pizzas"