app/controllers/restaurants_controller.rb

    def index
      # get all the restaurants from the database and assign them to an instance variable @restaurants
      @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

    def show
      # find the restaurant by its id from params and assign it to an instance variable @restaurant
      @restaurant = Restaurant.find_by(id: params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]